{
    "admin_created": "Super administrateur enregistré avec succès",
    "login_success": "Connexion réussie",
    "new_pwd_missing": "Veuillez envoyer new_password dans le corps de la demande ",
    "pwd_change_success": "Le mot de passe a été changé avec succès",
    "pwd_change_fail": "Échec de la modification du mot de passe",
    "company_name_missing": "Veuillez envoyer un nom de société dans le corps de la demande",
    "company_created": "Entreprise créée avec succès",
    "company_id_missing_params": "Veuillez fournir un identifiant d'entreprise dans l'URL de la demande",
    "company_name_updated": "Le nom de l'entreprise a bien été mis à jour",
    "company_name_update_failed": "Échec de la mise à jour du nom de l'entreprise",
    "company_deleted_successfully": "La société a bien été supprimée",
    "company_delete_failed": "Échec de la suppression de la société",
    "company_users_list_missing": "La liste des utilisateurs est absente du corps de la demande. Veuillez envoyer un tableau d'utilisateurs dans le corps de la demande enveloppé dans un objet. Exemple: { 'users_list' : [ {'first_name' : 'Robert'} , 'last_name' : 'Downey Jr' , 'type' : 'hr_admin or employee' , 'email' : 'robert@pushtalents.com' , 'position' : 'Manager' ]}",
    "body_data_missing" : "Le corps de la requête est manquant",
    "company_users_incorrect_data" : "Objet de données utilisateur incorrect. Veuillez envoyer prénom, nom, position, type_utilisateur et e-mail dans l'objet utilisateur",
    "users_created" : "Utilisateurs créés avec succès",
    "not_a_valid_enum" : "{{value}} n'est pas une valeur valide pour {{field}}. Les valeurs autorisées sont: {{allowed_values}}",
    "email_missing" : "Veuillez envoyer l'e-mail dans le corps de la demande",
    "email_not_found" : "Utilisateur avec e-mail = {{email}} introuvable. Veuillez vous assurer que l'e-mail est correct. Veuillez contacter l'administration de votre entreprise pour enregistrer votre e-mail si ce n'est toujours pas le cas",
    "email_otp_missing" : "Veuillez envoyer un e-mail et un otp dans le corps de la demande",
    "incorrect_email_otp" : "L'e-mail ou OTP est incorrect. Veuillez vous assurer de saisir une adresse e-mail enregistrée valide avec le bon OTP",
    "otp_expired" : "OTP a expiré. Veuillez demander un nouvel OTP et réessayer",
    "token_missing" : "Veuillez inclure le jeton dans l'en-tête comme Authentication",
    "user_token_not_found" : "Utilisateur introuvable, veuillez vous assurer que le jeton est valide. Reconnectez-vous et réessayez",
    "super_admin_not_found" : "Super administrateur introuvable, veuillez vous assurer que le jeton est valide. Reconnectez-vous et essayez avec le nouveau jeton d'authentification de connexion",
    "update_successful" : "Mise à jour réussie",
    "job_missing_data" : "Données incomplètes ou incorrectes pour le travail envoyé dans le corps de la demande. Veuillez vous assurer d'envoyer {url , title , location , reward_point , companyId , referral_success_reward_type , referral_success_reward_value} dans le corps de la demande",
    "job_created_successfully" : "Emploi créé avec succès",
    "employee_not_allowed" : "Seuls le super administrateur et la société hr_admin ont accès à ces données",
    "job_updated_successfully" : "Travail mis à jour avec succès",
    "job_update_failed" : "Échec de la mise à jour de la tâche",
    "job_id_missing_params" : "Veuillez indiquer un identifiant de travail dans l'URL de la demande",
    "job_share_link_generated" : "Lien de partage d'emploi généré avec succès",
    "job_id_missing" : "Veuillez envoyer l'ID de partage de tâches dans l'URL",
    "job_share_not_found" : "Aucun travail partagé avec l'ID = {{id}} n'a été trouvé",
    "missing_candidate_data" : "Les données du candidat sont manquantes ou incomplètes. Veuillez envoyer au candidat first_name, last_name et email dans le corps de la demande ",
    "hr_admin_not_allowed" : "Les RH de l'entreprise ne sont pas autorisés à faire des recommandations d'emploi. Seuls les employés de l'entreprise peuvent recommander un emploi via une application mobile",
    "job_referral_successful" : "Emploi référé avec succès",
    "referral_not_found" : "Référence d'emploi introuvable",
    "job_referral_id_missing" : "Veuillez envoyer l'identifiant de parrainage dans l'URL de la demande",
    "company_id_missing" : "Veuillez envoyer l'ID de l'entreprise dans le corps de la demande en tant qu'ID de l'entreprise",
    "article_data_cannot_be_fetched" : "Impossible de récupérer les données de l'URL de l'article.Si vous souhaitez ajouter manuellement des données pour cet article, veuillez envoyer un custom = true dans le corps de la requête avec title, thumb_url, companyId et is_active ",
    "article_custom_data_missing" : "Veuillez envoyer le titre de l'article et thumb_url dans le corps de la demande",
    "article_created_successfully" : "Article créé avec succès",
    "article_url_missing" : "L'URL de l'article est absente du corps de la demande",
    "article_id_missing" : "Veuillez envoyer l'ID de l'article dans le corps de la demande",
    "referral_stage_updated" : "Mise à jour de l'étape de référence d'emploi",
    "referral_stage_update_failed" : "Échec de la mise à jour de l'étape de référence du travail",
    "hr_admin_no_wallet" : "Seuls les employés de l'entreprise ont un portefeuille. Les administrateurs RH n'ont pas de portefeuille",
    "employee_cannot_see_others_wallet" : "Les employés de l'entreprise ne peuvent pas accéder aux autres détails du portefeuille",
    "user_id_missing" : "Veuillez envoyer l'ID utilisateur dans l'URL de la demande",
    "user_not_found_with_id" : "Aucun utilisateur avec l'ID = {{id}} n'a été trouvé dans votre entreprise. Veuillez vous assurer d'envoyer le bon ID utilisateur",
    "referral_stage_already_at" : "Rien à mettre à jour, la phase de recommandation d'emploi est déjà à {{stage}}",
    "article_share_link_generated" : "Lien de partage d'article généré avec succès",
    "article_share_not_found" : "Article partagé introuvable"

}